Plan for **main** is ready.
**Branch/Commit:** refs/heads/main / 25bc601ac67976945968c780f79fbb76a8bb2f65
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/20182614000

**Plan (last ~500 lines):**
```
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + values                     = [
          + <<-EOT
                "configs":
                  "params":
                    "server.insecure": true
                "global":
                  "domain": "argocd-prod.107363237542.montlabz.com"
                "server":
                  "ingress":
                    "annotations":
                      "cert-manager.io/cluster-issuer": "letsencrypt-staging"
                      "external-dns.alpha.kubernetes.io/hostname": "argocd-prod.107363237542.montlabz.com"
                      "ingress.cilium.io/backend-service-port": "http"
                      "ingress.cilium.io/force-https": "disabled"
                    "enabled": true
                    "ingressClassName": "cilium"
                    "tls":
                    - "hosts":
                      - "argocd-prod.107363237542.montlabz.com"
                      "secretName": "letsencrypt-staging"
            EOT,
        ]
      + verify                     = false
      + version                    = "5.51.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.aws_load_balancer_controller["this"] will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = true
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "1.16.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "platform-prod"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = "us-east-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = "arn:aws:iam::107363237542:role/eks/platform-prod/platform-prod-lbc"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-0b57293eb9992da49"
            # (1 unchanged attribute hidden)
        }
    }

  # module.helm.helm_release.cert_manager["this"] will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = true
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = true
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "v1.18.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "prometheus.enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "replicaCount"
          + value = "2"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "webhook.timeoutSeconds"
          + value = "30"
            # (1 unchanged attribute hidden)
        }
    }

  # module.helm.helm_release.jaeger["this"] will be created
  + resource "helm_release" "jaeger" {
      + atomic                     = true
      + chart                      = "jaeger"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "jaeger"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://jaegertracing.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "agent":
                  "enabled": false
                "allInOne":
                  "enabled": true
                  "extraArgs":
                  - "--collector.otlp.enabled=true"
                  - "--collector.otlp.grpc.host-port=:4317"
                  - "--collector.otlp.http.host-port=:4318"
                  "ingress":
                    "annotations":
                      "cert-manager.io/cluster-issuer": "letsencrypt-staging"
                      "external-dns.alpha.kubernetes.io/hostname": "jaeger-prod.107363237542.montlabz.com"
                      "ingress.cilium.io/force-https": "disabled"
                    "enabled": true
                    "hosts":
                    - "jaeger-prod.107363237542.montlabz.com"
                    "ingressClassName": "cilium"
                    "tls":
                    - "hosts":
                      - "jaeger-prod.107363237542.montlabz.com"
                      "secretName": "letsencrypt-staging"
                  "service":
                    "ports":
                      "grpc": 14250
                      "http": 16686
                      "otlp-grpc": 4317
                      "otlp-http": 4318
                "cassandra":
                  "enabled": false
                "collector":
                  "enabled": false
                "elasticsearch":
                  "enabled": false
                "esRollover":
                  "enabled": false
                "fullnameOverride": "jaeger"
                "indexCleaner":
                  "enabled": false
                "kafka":
                  "enabled": false
                "provisionDataStore":
                  "cassandra": false
                  "elasticsearch": false
                "query":
                  "enabled": false
                "storage":
                  "type": "memory"
            EOT,
        ]
      + verify                     = false
      + version                    = "3.4.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.loki["this"] will be created
  + resource "helm_release" "loki" {
      + atomic                     = true
      + chart                      = "loki-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "grafana":
                  "enabled": false
                "loki":
                  "auth_enabled": false
                  "commonConfig":
                    "replication_factor": 1
                  "enabled": true
                  "schemaConfig":
                    "configs":
                    - "from": "2024-01-01"
                      "index":
                        "period": "24h"
                        "prefix": "index_"
                      "object_store": "filesystem"
                      "schema": "v13"
                      "store": "tsdb"
                  "service":
                    "port": 3100
                    "type": "ClusterIP"
                  "serviceMonitor":
                    "enabled": true
                  "singleBinary":
                    "enabled": true
                  "storage":
                    "type": "filesystem"
                "promtail":
                  "config":
                    "clients":
                    - "url": "http://loki.monitoring.svc.cluster.local:3100/loki/api/v1/push"
                    "positions":
                      "filename": "/run/promtail/positions.yaml"
                    "scrape_configs":
                    - "job_name": "kubernetes-pods"
                      "kubernetes_sd_configs":
                      - "role": "pod"
                      "pipeline_stages":
                      - "cri": {}
                      - "regex":
                          "expression": ".*(?:trace[id|_id|Id]|otel.trace_id)=(?P<trace_id>[A-Za-z0-9]+).*"
                      - "labels":
                          "trace_id": ""
                      "relabel_configs":
                      - "source_labels":
                        - "__meta_kubernetes_pod_node_name"
                        "target_label": "node"
                      - "source_labels":
                        - "__meta_kubernetes_namespace"
                        "target_label": "namespace"
                      - "source_labels":
                        - "__meta_kubernetes_pod_name"
                        "target_label": "pod"
                      - "source_labels":
                        - "__meta_kubernetes_pod_container_name"
                        "target_label": "container"
                      - "source_labels":
                        - "__meta_kubernetes_pod_label_app_kubernetes_io_name"
                        "target_label": "app"
                      - "action": "replace"
                        "regex": "(.+)"
                        "source_labels":
                        - "__meta_kubernetes_pod_label_app"
                        "target_label": "app"
                      - "action": "replace"
                        "replacement": "/var/log/pods/*$1/*.log"
                        "source_labels":
                        - "__meta_kubernetes_pod_uid"
                        - "__meta_kubernetes_pod_container_name"
                        "target_label": "__path__"
                    "server":
                      "grpc_listen_port": 0
                      "http_listen_port": 3101
                  "enabled": true
                  "serviceMonitor":
                    "enabled": true
                    "labels":
                      "release": "kube-prometheus-stack"
            EOT,
        ]
      + verify                     = false
      + version                    = "2.10.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.otel_collector["this"] will be created
  + resource "helm_release" "otel_collector" {
      + atomic                     = true
      + chart                      = "opentelemetry-collector"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "otel-collector"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://open-telemetry.github.io/opentelemetry-helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "config":
                  "exporters":
                    "debug":
                      "verbosity": "normal"
                    "otlp/jaeger":
                      "endpoint": "jaeger-collector:4317"
                      "tls":
                        "insecure": true
                    "otlp/tempo":
                      "endpoint": "tempo:4317"
                      "tls":
                        "insecure": true
                    "prometheus":
                      "endpoint": "0.0.0.0:9464"
                  "processors":
                    "batch": {}
                  "receivers":
                    "otlp":
                      "protocols":
                        "grpc":
                          "endpoint": "0.0.0.0:4317"
                        "http":
                          "endpoint": "0.0.0.0:4318"
                  "service":
                    "pipelines":
                      "logs":
                        "exporters":
                        - "debug"
                        "processors":
                        - "batch"
                        "receivers":
                        - "otlp"
                      "metrics":
                        "exporters":
                        - "prometheus"
                        - "debug"
                        "processors":
                        - "batch"
                        "receivers":
                        - "otlp"
                      "traces":
                        "exporters":
                        - "otlp/jaeger"
                        - "otlp/tempo"
                        - "debug"
                        "processors":
                        - "batch"
                        "receivers":
                        - "otlp"
                    "telemetry":
                      "logs":
                        "level": "info"
                "image":
                  "repository": "otel/opentelemetry-collector-contrib"
                "mode": "deployment"
                "resources":
                  "limits":
                    "cpu": "500m"
                    "memory": "512Mi"
                  "requests":
                    "cpu": "100m"
                    "memory": "256Mi"
                "service":
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.132.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.tempo["this"] will be created
  + resource "helm_release" "tempo" {
      + atomic                     = true
      + chart                      = "tempo"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "tempo"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                "fullnameOverride": "tempo"
                "service":
                  "type": "ClusterIP"
                "serviceMonitor":
                  "enabled": true
                "tempo":
                  "config": "server:\r\n  http_listen_port: 3200\r\ndistributor:\r\n  receivers:\r\n
                    \   otlp:\r\n      protocols:\r\n        http: {}\r\n        grpc: {}\r\nstorage:\r\n
                    \ trace:\r\n    backend: local\r\n    local:\r\n      path: /var/tempo\r\n"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.23.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
